SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pctb_template/example/EWARM/hc32f460pctb.svd
                <register>
                    <name>PEVNTFAL1</name>
                    <description>desc PEVNTFAL1</description>
                    <addressOffset>0x118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FAL00</name>
                            <description>desc FAL00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL01</name>
                            <description>desc FAL01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL02</name>
                            <description>desc FAL02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL03</name>
                            <description>desc FAL03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL04</name>
                            <description>desc FAL04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL05</name>
                            <description>desc FAL05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL06</name>
                            <description>desc FAL06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL07</name>
                            <description>desc FAL07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL08</name>
                            <description>desc FAL08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL09</name>
                            <description>desc FAL09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL10</name>
                            <description>desc FAL10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL11</name>
                            <description>desc FAL11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL12</name>
                            <description>desc FAL12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL13</name>
                            <description>desc FAL13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL14</name>
                            <description>desc FAL14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FAL15</name>
                            <description>desc FAL15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTDIRR2</name>
                    <description>desc PEVNTDIRR2</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDIR00</name>
                            <description>desc PDIR00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR01</name>
                            <description>desc PDIR01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR02</name>
                            <description>desc PDIR02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR03</name>
                            <description>desc PDIR03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR04</name>
                            <description>desc PDIR04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR05</name>
                            <description>desc PDIR05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR06</name>
                            <description>desc PDIR06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR07</name>
                            <description>desc PDIR07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR08</name>
                            <description>desc PDIR08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR09</name>
                            <description>desc PDIR09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR10</name>
                            <description>desc PDIR10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR11</name>
                            <description>desc PDIR11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR12</name>
                            <description>desc PDIR12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR13</name>
                            <description>desc PDIR13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR14</name>
                            <description>desc PDIR14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDIR15</name>
                            <description>desc PDIR15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTIDR2</name>
                    <description>desc PEVNTIDR2</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIN00</name>
                            <description>desc PIN00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN01</name>
                            <description>desc PIN01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN02</name>
                            <description>desc PIN02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN03</name>
                            <description>desc PIN03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN04</name>
                            <description>desc PIN04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN05</name>
                            <description>desc PIN05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN06</name>
                            <description>desc PIN06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN07</name>
                            <description>desc PIN07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN08</name>
                            <description>desc PIN08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN09</name>
                            <description>desc PIN09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <description>desc PIN10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <description>desc PIN11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <description>desc PIN12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <description>desc PIN13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <description>desc PIN14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <description>desc PIN15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTODR2</name>
                    <description>desc PEVNTODR2</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POUT00</name>
                            <description>desc POUT00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT01</name>
                            <description>desc POUT01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT02</name>
                            <description>desc POUT02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT03</name>
                            <description>desc POUT03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT04</name>
                            <description>desc POUT04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT05</name>
                            <description>desc POUT05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT06</name>
                            <description>desc POUT06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT07</name>
                            <description>desc POUT07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT08</name>
                            <description>desc POUT08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT09</name>
                            <description>desc POUT09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT10</name>
                            <description>desc POUT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT11</name>
                            <description>desc POUT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT12</name>
                            <description>desc POUT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT13</name>
                            <description>desc POUT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT14</name>
                            <description>desc POUT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT15</name>
                            <description>desc POUT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
